Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བདག་གིས་འདིའི་རུས་བུའི་མཆོད་པ་ཡང་མ་བགྱིས་པར་ཁྱོད་དང་ལྷན་ཅིག་ཏུ་ཇི་ལྟར་འདུ་བར་བགྱིས།
en: ‘How can we be together when I haven’t even performed the ritual veneration of my husband’s remains?

source: རེ་ཞིག་བདག་གིས་སྔར་འདིའི་རུས་བུ་ལ་མཆོད་པ་བགྱིས་ལ་དེའི་འོག་ཏུ་གདོད་ཇོ་བོ་ཇི་ལྟར་དགྱེས་པ་བཞིན་དུ་བགྱིའོ་ཞེས་བྱས་ནས།
en: First let me venerate his remains for a time. After that, lord, I shall do as you please.’

source: དེ་ཐོས་མ་ཐག་ཏུ་སྣ་ལ་གཏོགས་པ་དེས་དགེ་བསྙེན་དེའི་རུས་བུ་དུར་ཁྲོད་དུ་ཁྱེར་ཏེ། རུས་བུ་བསྲེགས་ནས་
en: “No sooner was this said than the petty official bore the lay vow holder’s remains to the charnel ground and incinerated them.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་བུད་མེད་དེས་མེ་འབར་བ་དེའི་ནང་དུ་མཆོངས་ནས་དེ་ཡང་དེ་ཉིད་དུ་ཤིའོ། །
en: As he sat there with his back to her, the woman leapt into the burning fire and died on the spot.

source: དེ་ནས་སྣ་ལ་གཏོགས་པ་དེ་རྒྱུ་དེས་སེམས་ཁོངས་སུ་ཆུད་དེ་བདག་གིས་བྱ་བ་མ་ཡིན་པ་འདི་ལྟ་བུ་ཅི་དང་ཅི་བྱ་བྱ།
en: At this the petty official began to brood, thinking, ‘Such wrongs I have committed, one after the other!

source: བདག་བུད་མེད་དང་ཕྲད་པ་ལ་ཡང་མ་ཕན་ལ་འདི་ལ་ཡང་བདག་གིས་མི་རིགས་པ་འདི་ལྟ་བུ་བྱས་ཀྱིས་མེད་དོ་སྙམ་མོ། །
en: Meeting that woman was of no benefit. Not only did I commit such senseless acts, but now she’s gone.’

source: དེའི་ཚེ་སྣ་ལ་གཏོགས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཆུ་སྲིན་དེ་ཉིད་ཡིན་ཏེ།
en: The one who was that petty official then is none other than this sea creature.

source: དེས་དགེ་བསྙེན་དེ་འབྲེང་རློན་གྱིས་གཞུས་ཏེ་རྩིབ་མ་རྣམས་བཅོམ་ནས། དེ་ཡང་དེའི་རྐྱེན་གྱིས་ཤི་བར་གྱུར་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་སྣ་ལ་གཏོགས་པ་དེ་སེམས་ཅན་དམྱལ་བའི་ནང་དུ་སྐྱེས་ཏེ།
en: The act of beating the lay vow holder with a wet strip of leather and causing his death ripened such that the petty official took rebirth as a hell being,

source: དེ་དེར་ལོ་མང་པོ་ལོ་སྟོང་ཕྲག་མང་པོར་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་མྱོང་ནས་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་དུད་འགྲོའི་ནང་དུ་སྐྱེས་ཏེ།
en: where he underwent the sufferings of the hell beings for thousands upon thousands of years.

source: དུད་འགྲོའི་ནང་ནས་ཤི་འཕོས་ཤིང་དུད་འགྲོའི་ནང་འབའ་ཞིག་ཏུ་སྐྱེས་ནས་སྡུག་བསྔལ་དེ་ལྟ་བུ་ཤ་སྟག་རྙེད་དོ། །
en: When he died, he transmigrated and took rebirth among the animals, dying from among the animals only to transmigrate and take birth among the animals again. Such are his sufferings.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Venerable Maudgalyāyana inquired of the Blessed One,

source: བཙུན་པ་སེམས་ཅན་དེ་སྡུག་བསྔལ་དེ་ལས་ནམ་ཐར་བར་འགྱུར་ལགས།
en: “Lord, when will this being be liberated from his suffering?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་མ་འོངས་པའི་དུས་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡིད་བཟངས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ
en: “Maudgalyāyana,” the Blessed One replied, “in the future a totally and completely awakened buddha named Sumati , who will far surpass the listeners and the solitary buddhas, will emerge in the world.

source: དེའི་རིང་ལ་སེམས་ཅན་འདིའི་ལས་དེ་ཟད་དེ།
en: At that distant time the actions of this being will be exhausted.

source: མིར་སྐྱེས་ནས་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ཏེ་
en: After attaining a human birth, he will go forth solely in the doctrine of Sumati , cast away the afflictive emotions, and manifest arhatship.

source: དེར་འདིའི་སྡུག་བསྔལ་མཐར་ཐུག་པར་འགྱུར་རོ། །
en: Then his suffering will come to an end.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་མང་པོ་དེ་དག་སྐྱོ་བ་ཆེན་པོ་སྐྱེས་ཏེ།
en: As soon as they heard this, the people gathered there welled up with grief.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་ཡིད་སྐྱོ་བར་གྱུར་པར་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their grief, taught them the Dharma accordingly,

source: དེས་ན་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: and among the assembled some generated heat right where they sat.

source: ཁ་ཅིག་གིས་ནི་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་བ་དང་།
en: some to become great universal monarchs,

source: ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་།
en: some for the enlightenment of the solitary buddhas,

source: ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ས་བོན་བསྐྱེད་དོ། །
en: and some for unexcelled, total, and complete enlightenment.

source: འཁོར་དེ་དག་གི་ནང་ནས་ཕལ་ཆེར་ནི་སངས་རྒྱས་ལ་གཞོལ་ཆོས་ལ་འབབ་དགེ་འདུན་ལ་བབ་པར་བྱས་ཏེ་བཀོད་དོ།། །།
en: Among the assembled, most found themselves drawn to the Buddha, intent on the Dharma, and favoring the Saṅgha.

source: གཅོད་པ་ཕྱི་མ་ནི།
en: The Second “Cut” Story

source: ལྷའི་ནང་དུ་རྒྱུ་བར་བྱེད་དེ།
en: and to wander among the gods.

source: ཕྱིར་འོངས་ནས་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་གཅད་པ་དང་གཏུབ་པ་དང་བརྡེག་པ་དང་བཙོ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་གང་ཡིན་པ་དེ་དག་མི་རྣམས་ལ་རྗོད་པར་བྱེད་དོ། །
en: When he returned, he would relate to people how the hell beings suffer through being cut up, hacked apart, beaten, roasted, and so on.

source: ཕྱིར་འོངས་ནས་ཡི་དགས་རྣམས་ཀྱི་བཀྲེས་པ་དང་སྐོམ་པ་དང་འབར་བ་དང་བསྲེག་པ་དང་བཙོ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་རྣམས་དང་།
en: When he returned, he would also relate to people how the anguished spirits suffer through hunger, thirst, being burned, being incinerated, being cooked, and so on;

source: དེ་དག་གིས་དེ་ཐོས་ནས་སྐྱོ་བར་འགྱུར་ལ། སྐྱོ་བར་གྱུར་ནས་ཀྱང་གོང་དུ་ཁྱད་པར་ཐོབ་པར་འགྱུར་རོ། །
en: Those who heard him were filled with sorrow, and from this sorrow they went on to achieve great things.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་ཆས་ནས་མཉན་དུ་ཡོད་པ་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: One day Venerable Mahā­maudgalyāyana prepared himself to wander among the anguished spirits, disappeared from Śrāvastī,

source: དེ་རྒྱ་མཚོའི་འགྲམ་དུ་འགྲེང་བ་དང་དེས་དེར་ཡི་དགས་ལུས་ཆེ་ལ་
en: and stood on the seashore, where there lay an anguished spirit with an enormous body.

source: རོ་སྨད་ནི་ཐ་མལ་པར་འདུག །རྐེད་པ་ཡན་ཆད་ནི་ལུས་གཉིས་སུ་འདུག་སྟེ།
en: The lower half looked very ordinary, but from the waist up it was like two separate bodies.

source: དེ་ཡང་འབར་ཞིང་རབ་ཏུ་འབར་ལ་ཀུན་དུ་རབ་ཏུ་འབར་ཏེ།
en: He was on fire, burning all over, covered in flames,

source: ཕན་ཚུན་དུ་རྒྱུ་བ་དེ་ལ་དེའི་ལས་ལས་སྐྱེས་པའི་ལྕགས་ཀྱི་མཆེ་བ་ཅན་གྱི་སེང་གེ་དང་སྟག་དང་གཟིག་དང་དྲེད་ལ་སོགས་པ་དེའི་དྲུང་དུ་ལྷགས་ནས། དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟ་བར་བྱེད་པ་དང་།
en: and he lurched all about until, due to his past actions, lions, tigers, leopards, bears, and the like, all with fangs of iron, appeared and tore into his flesh over and over again and fed on him.

source: ལས་ལས་སྐྱེས་པའི་མི་དག་ཀྱང་ལྷགས་ནས་རལ་གྲི་རྣོན་པོ་དག་གིས་རོ་སྟོད་གཅོད་པར་བྱེད་དེ
en: Humans appeared there due to his past actions as well, and they took up sharp swords and hacked at his upper body.

source: དེའི་རོ་སྟོད་གཅིག་བཅད་ན་ཅིག་ཤོས་འབྱུང་བར་འགྱུར་ལ་ཅིག་ཤོས་བཅད་ན་ཡང་གཅིག་འབྱུང་བར་འགྱུར་ཏེ།
en: While they hacked away at one side of his upper body, the other side would regenerate, and when they hacked away at the other side, the first side would regenerate.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་ལ་སྐད་པོ་ཆེ་འཐོན་ཅིང་། ཕན་ཚུན་དུ་འབྲོས་ཏེ་
en: This caused him dreadful suffering and extreme, excruciating, unbearable agony, and he let loose great cries.

source: ལས་ལས་སྐྱེས་པའི་མི་དེ་དག་ཀྱང་དེའི་ཕྱི་བཞིན་འབྲང་བ་ཞིག་མཐོང་ནས
en: As he tried to flee, the humans who appeared due to his past actions pursued him.

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བསམས་པ།
en: Seeing all this, Mahā­maudgalyāyana thought,

source: སེམས་ཅན་འདིས་ལས་ཅི་ཞིག་བྱས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་སྡུག་བསྔལ་འདི་ལྟ་བུ་མྱོང་ཞིག་གུ་སྙམ་ནས
en: “What action did this being take that ripened into such suffering?”

source: དེས་བལྟས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: When he examined that being’s past lives, he saw that after going forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, the spirit had acted as steward for the monks.

source: དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་ནས། དེས་དགེ་སློང་དབྱར་གནས་བཅས་པ་རྣམས་ཀྱི་གོས་དང་རྙེད་པ་རྣམས་བཅད་དེ་དགུན་གནས་བཅས་པ་རྣམས་ལ་ཕུལ།
en: But then he cut off the monks in rainy season retreat from all material support and clothing and offered it to the monks in winter retreat.

source: དགུན་གནས་བཅས་པ་རྣམས་ཀྱི་གོས་དང་རྙེད་པ་རྣམས་བཅད་དེ་དབྱར་གནས་བཅས་པ་རྣམས་ལ་ཕུལ།
en: Then he cut off the monks in winter retreat from all material support and clothing and offered it to the monks in rainy season retreat.

source: གཉི་ག་ལས་བཅད་དེ་ཁ་ཅིག་ནི་བདག་ཉིད་ཀྱིས་སྤྱད། ཁ་ཅིག་ནི་གཞན་དག་ལ་ཕུལ་བ་མཐོང་ངོ་། །
en: Finally, he cut off both from all material support and clothing, used some of it for himself, and offered the rest to others.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བསམས་པ།
en: Venerable Mahā­maudgalyāyana thought,

source: འདིའི་ལས་ནི་བདག་གིས་ཀྱང་ཡང་དག་པར་མངོན་སུམ་དུ་མཐོང་མོད་ཀྱི་འོན་ཀྱང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུའོ་སྙམ་ནས་
en: “Though indeed I can see his past actions clearly, still I shall ask the Blessed One about this so that many might become disillusioned with saṃsāra.”

source: རྒྱ་མཚོའི་འགྲམ་ནས་མི་སྣང་བར་གྱུར་ཏེ་མཉན་དུ་ཡོད་པར་སོང་བ་དང་། དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་བཞུགས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: He disappeared from the shore of the great ocean and traveled to Śrāvastī, where the Blessed One sat teaching the Dharma amid a company of hundreds.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མ་ལ་ཆོས་སྟོན་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེས་བསམས་པ་འདི་ནི་
en: Then Venerable Mahā­maudgalyāyana, seeing that the Blessed One was teaching the Dharma amid a company of hundreds, thought,

source: བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཡི་དགས་ཀྱི་ལུང་བསྟན་པ་ཞུ་བའི་དུས་ཡིན་ནོ་སྙམ་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Now is the time to request the Blessed One to explain about that anguished spirit.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: He approached the Blessed One, touched his head to the Blessed One’s feet, and took a seat at one side.

source: སླར་མཆིས་ནས་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་གཅད་པ་དང་གཏུབ་པ་དང་བརྡེག་པ་དང་བཙོ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་གང་ལགས་པ་དེ་དག་མི་རྣམས་ལ་རྗོད་པར་བགྱིད་པ་ལགས་སོ། །
en: “When I return I relate to people how the hell beings suffer through being cut up, hacked apart, beaten, roasted, and so on.

source: དུད་འགྲོ་རྣམས་ཀྱི་གཅིག་ལ་གཅིག་ཟ་བ་ལས་གྱུར་པའི་སྡུག་བསྔལ་རྣམས་དང་མི་རྣམས་ཀྱི་ཚོལ་ཁྲོས་ཤ་ཐང་བའི་སྡུག་བསྔལ་རྣམས་དང་།
en: how animals suffer as they eat one another; how human beings suffer through striving, anger, and exhaustion;

source: ལྷ་རྣམས་ཀྱི་འཆི་འཕོ་དང་ལྟུང་བ་དང་རྣམ་པར་འཐོར་བ་དང་། རྣམ་པར་འཇིག་པའི་སྡུག་བསྔལ་གང་ལགས་པ་དེ་དག་མི་རྣམས་ལ་རྗོད་པར་བགྱིད་དེ།
en: and how the gods suffer through dying, falling, disintegrating, and decaying.

source: རྒྱུ་དེས་ན་དེ་དག་སྐྱོ་བར་འགྱུར་ལ་སྐྱོ་བར་གྱུར་ནས་ཀྱང་གོང་དུ་ཁྱད་པར་འཐོབ་པར་འགྱུར་ལགས་སོ། །
en: Because of this, the people who hear me are filled with sorrow, and from this sorrow they go on to achieve great things.

source: བཙུན་པ་བདག་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་ཞིང་མཆི་མཆི་བ་ལས། ཡི་དགས་ལུས་ཆེ་བ་ལ་
en: “Lord, as I was wandering among the anguished spirits, I saw an anguished spirit with an enormous body.

source: རོ་སྨད་ནི་ཐ་མལ་པར་མཆིས་རྐེད་པ་ཡན་ཆད་ནི་ལུས་གཉིས་སུ་མཆིས་ཏེ
en: The lower end looked very ordinary, but from the waist up it was like two separate bodies.

source: དེ་ཡང་འབར་ཞིང་རབ་ཏུ་འབར་ལ་ཀུན་དུ་འབར་ཏེ།
en: He was on fire, burning all over, and covered in flames,

source: ཕན་ཚུན་དུ་རྒྱུ་ལ་དེའི་ལས་ལས་སྐྱེས་པའི་ལྕགས་ཀྱི་མཆེ་བ་ཅན་གྱི་སེང་གེ་དང་སྟག་དང་གཟིག་དང་དྲེད་ལ་སོགས་པ་དེའི་དྲུང་དུ་ལྷགས་ནས་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟ་བར་བགྱིད་པ་དང་
en: and he lurched all about until, due to his past actions, lions, tigers, leopards, bears, and the like, all with fangs of iron, appeared and tore into his flesh over and over again and fed on him.

source: ལས་ལས་སྐྱེས་པའི་མི་དག་ཀྱང་ལྷགས་ནས། རལ་གྲི་རྣོན་པོ་དག་གིས་རོ་སྟོད་གཅོད་པར་བགྱིད་དེ།
en: “Humans appeared there due to his past actions as well, and they took up sharp swords and hacked at his upper body.

source: དེའི་རོ་སྟོད་གཅིག་བཅད་ན་ཅིག་ཤོས་འབྱུང་བར་འགྱུར་ལ།
en: While they hacked away at one side of his upper body, the other side would regenerate,

source: ཅིག་ཤོས་བཅད་ན་ཡང་གཅིག་འབྱུང་བར་འགྱུར་ཏེ།
en: and when they hacked away at the other side, the first side would regenerate.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་། ཚ་བ་དང་། ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་ལ་སྐད་པོ་ཆེ་འཐོན་ཅིང་
en: This caused him dreadful suffering and extreme, excruciating, unbearable agony, and he let loose a great cry.

source: ཕན་ཚུན་འབྲོས་ཏེ། ལས་ལས་སྐྱེས་པའི་མི་དེ་དག་ཀྱང་དེའི་ཕྱི་བཞིན་འབྲང་བ་ཞིག་མཐོང་ལགས་ན།
en: As he tried to flee, the humans who appeared due to his past actions pursued him.

source: བཙུན་པ་ཡི་དགས་དེས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་སྡུག་བསྔལ་དེ་ལྟ་བུ་རྙེད་པར་གྱུར་ལགས།
en: “Lord, what action did this anguished spirit take that ripened into his meeting with such suffering?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་སེམས་ཅན་དེ་ནི་སྡིག་པ་བྱེད་བྱེད་པ་ཡིན་ཏེ
en: “Maudgalyāyana,” the Blessed One explained, “that being committed nonvirtuous actions over and over again.

source: དེས་སྡིག་པ་མང་དུ་བྱས་སོ། །
en: He committed many nonvirtuous actions.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་བསྟན་པ་ལ་སེམས་ཅན་འདི་རབ་ཏུ་བྱུང་ནས་ཞལ་ཏ་བྱེད་པར་གྱུར་ཏེ།
en: “Maudgalyāyana, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, that being went forth in his doctrine.

source: དེས་དེར་དགེ་སློང་དབྱར་གནས་བཅས་པ་རྣམས་ཀྱི་གོས་དང་རྙེད་པ་རྣམས་བཅད་དེ་དགུན་གནས་པ་རྣམས་ལ་ཕུལ།
en: He acted as steward for the monks, but then he cut off the monks in rainy season retreat from all material support and clothing and offered it to the monks in winter retreat.

source: དགུན་གནས་བཅས་པ་རྣམས་ཀྱི་གོས་དང་རྙེད་པ་རྣམས་བཅད་དེ་དབྱར་གནས་བཅས་པ་རྣམས་ལ་ཕུལ་
en: Then he cut off the monks in winter retreat from all material support and clothing and offered it to the monks in rainy season retreat.

source: གཉི་ག་ལས་བཅད་དེ་ཁ་ཅིག་ནི་བདག་ཉིད་ཀྱིས་སྤྱད། ཁ་ཅིག་ནི་གཞན་དག་ལ་ཕུལ་ལོ། །
en: Finally, he cut off both from all material support and clothing, used some of it for himself, and offered the rest to others.

source: མཽད་གལ་གྱི་བུ་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ་ཞལ་ཏ་བྱེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཡི་དགས་འདི་ཁོ་ན་ཡིན་ཏེ།
en: “Maudgalyāyana, what do you think? The one who provided for those monks then is none other than this anguished spirit.

source: དེས་དེར་དབྱར་གནས་བཅས་པ་རྣམས་ཀྱི་གོས་དང་རྙེད་པ་རྣམས་བཅད་དེ་དགུན་གནས་བཅས་པ་རྣམས་ལ་ཕུལ།
en: At that time he cut off the monks in rainy season retreat from all material support and clothing and offered it to the monks in winter retreat.

source: དགུན་གནས་བཅས་པ་རྣམས་ཀྱི་གོས་དང་རྙེད་པ་རྣམས་བཅད་དེ་དབྱར་གནས་བཅས་པ་རྣམས་ལ་ཕུལ་བའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་རྐེད་པ་ཡན་ཆད་ལུས་གཉིས་སུ་འདུག་པར་གྱུར་ཏེ
en: Then he cut off the monks in winter retreat from all material support and clothing and offered it to the monks in rainy season retreat. Those acts ripened such that this being was like two separate bodies from the waist up,

source: ལས་ལས་སྐྱེས་པའི་མི་རྣམས་དེའི་དྲུང་དུ་ལྷགས་ནས། དེ་དག་གིས་རལ་གྲི་རྣོན་པོས་དེའི་རོ་སྟོད་གཅོད་པར་བྱེད་དེ།
en: and humans appeared due to his past actions who took up sharp swords and hacked at his upper body.

source: ཅིག་ཤོས་བཅད་ན་ཡང་གཅིག་འབྱུང་བར་འགྱུར་རོ། །
en: and when they hacked away at the other side, the first side would regenerate.

source: དེས་གཉི་ག་ལས་བཅད་དེ་ཁ་ཅིག་ནི་བདག་ཉིད་ཀྱིས་སྤྱད། ཁ་ཅིག་ནི་གཞན་དག་ལ་ཕུལ་བའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་ལྕགས་ཀྱི་མཆེ་བ་ཅན་གྱི་སེང་གེ་དང་སྟག་དང་གཟིག་དང་དྲེད་ལ་སོགས་པ་བྱུང་ནས། དེ་དག་གིས་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟ་བར་གྱུར་ཏོ། །
en: “The act of finally cutting off both from all material support and clothing, using some of it for himself, and offering the rest to others ripened such that there fell upon him lions, tigers, leopards, bears, and the like, all with fangs of iron, that tore into his flesh over and over again and fed on him, causing him dreadful suffering and extreme, excruciating, unbearable agony until he let loose a great cry, and that as he tried to flee, the humans who appeared due to his past actions pursued him.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Venerable Mahā­maudgalyāyana inquired of the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་མ་འོངས་པའི་དུས་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཞན་གྱིས་མི་ཐུབ་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ
en: “Maudgalyāyana,” the Blessed One replied, “in the future a totally and completely awakened buddha named Aparājita, who will far surpass the listeners and the solitary buddhas, will emerge in the world.

source: དེའི་རིང་ལ་སེམས་ཅན་དེའི་ལས་ཟད་ནས་
en: At that distant time the actions of this being will be exhausted.

source: མིར་སྐྱེ་བར་འགྱུར་ལ། དེ་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ཏེ
en: After he attains a human birth, he will go forth in the doctrine of Aparājita alone, cast away the afflictive emotions, and manifest arhatship.

source: དེར་དེའི་སྡུག་བསྔལ་མཐར་ཐུག་པར་འགྱུར་རོ། །
en: Then his suffering will come to an end.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་དེ་དག་སྐྱོ་བ་ཆེན་པོ་སྐྱེས་ཏེ།
en: As soon as they heard this, the people gathered there welled up with grief.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ཡིད་སྐྱོ་བར་གྱུར་པ་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ། དེ་ནས་འཁོར་དེ་དག་གི་ནང་ནས་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: The Blessed One directly apprehended their grief, taught them the Dharma accordingly, and among the assembled some generated heat right where they sat.

source: ཟ་བ་ཞེས་བྱ་བ་ནི།
en: Being Devoured

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ནི་ལུགས་ཀྱིས་དུས་དུས་སུ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་རྒྱུ་བར་བྱེད།
en: When the Blessed One was in Śrāvastī, it was Venerable Maudgalyāyana’s custom to wander from time to time among the hell beings,

source: དེ་དག་གིས་དེ་ཐོས་ནས་སྐྱོ་བར་འགྱུར་ལ་དེ་ལྟར་སྐྱོ་བར་གྱུར་ནས་ཀྱང་གོང་དུ་ཁྱད་པར་ཐོབ་པར་འགྱུར་རོ། །
en: Those who heard him were filled with sorrow, and from this sorrow they went on to achieve great things.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་ཆས་ནས། མཉན་དུ་ཡོད་པ་ནས་མི་སྣང་བར་གྱུར་ཏེ། རི་བྱིན་ཏྱའི་ནགས་ཁུང་དུ་ཕྱིན་པ་དང་། དེས་དེར་ཡི་དགས་འབར་ཞིང་རབ་ཏུ་འབར་ལ་ཀུན་དུ་རབ་ཏུ་འབར་ཏེ་
en: One day Venerable Mahā­maudgalyāyana, prepared himself to wander among the anguished spirits, disappeared from Śrāvastī, and traveled to Vindhyācala, to a hollow in the forest where he saw an anguished spirit that was on fire, burning all over, and covered in flames—

source: མེ་ལྕེ་གཅིག་ཏུ་འབར་ལ་དེ་གལ་ཏེ་ཐང་ལ་འགྲོ་ན་
en: he was nothing but a single, searing flame.

source: ནི་དེའི་ལས་ལས་སྐྱེས་པའི་ལྕགས་ཀྱི་མཆེ་བ་ཅན་གྱི་སེང་གེ་དང་སྟག་དང་གཟིག་དང་དྲེད་ལ་སོགས་པ་འབྱུང་བར་འགྱུར་ཏེདེ་དག་གིས་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟ་བར་བྱེད་དེ།
en: When he fled to the plains, due to his past actions lions, tigers, leopards, bears, and the like, all with fangs of iron, appeared and tore into his flesh over and over again and fed on him.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་ལ་ཕན་ཚུན་དུ་རྒྱུག་པ་ཞིག་མཐོང་ངོ་། །
en: This caused him extreme, excruciating, unbearable agony, and he ran all about.

source: མཐོང་ནས་ཀྱང་སེམས་པ་ལ་ཞུགས་ཏེ།
en: Seeing him, Venerable Mahā­maudgalyāyana thought,

source: སེམས་ཅན་འདིས་ལས་ཅི་ཞིག་བྱས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་སྡུག་བསྔལ་འདི་ལྟ་བུ་ཉམས་སུ་མྱོང་བར་འགྱུར་ཞིག་གུ་སྙམ་ནས།
en: “What action did this being take that ripened into such suffering?”

source: དེས་བལྟས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་སྟེ། དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་ནས་དེས་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱེད་པ་ན།
en: When he examined that being’s past lives, he saw that after going forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, the spirit had acted as steward for the monks,

source: དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་ལ་ཅི་དགའ་མགུར་སྤྱད་ལ་གཞན་དག་ལ་ཡང་བྱིན་པ་མཐོང་ངོ་། །
en: but then he used the donations for the saṅgha, the donations to the stūpa, their means of regular support, and the donations for the saṅgha of the four directions to indulge himself as he pleased and to make gifts of it to others.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བསམས་པ་འདིའི་ལས་ནི་བདག་གིས་ཀྱང་ཡང་དག་པར་མངོན་སུམ་དུ་མཐོང་མོད་ཀྱི།
en: Thereupon Venerable Mahā­maudgalyāyana thought, “Though indeed I can see his past actions clearly,

source: འོན་ཀྱང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུའོ་སྙམ་མོ། །
en: still I shall ask the Blessed One about this, so that many might become disillusioned with saṃsāra.”

source: རི་བྱིན་ཏྱའི་ནགས་ཁུང་ནས་མི་སྣང་བར་གྱུར་ཏེ། མཉན་དུ་ཡོད་པར་སོང་བ་དང་། དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་བཞུགས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: He disappeared from the hollow in the forest at Vindhyācala and traveled to Śrāvastī, where the Blessed One sat teaching the Dharma amid a company of hundreds.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མ་ལ་ཆོས་སྟོན་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེས་བསམས་པ།
en: Then Venerable Mahā­maudgalyāyana, seeing that the Blessed One was teaching the Dharma amid a company of hundreds, thought,

source: འདི་ནི་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཡི་དགས་ཀྱི་ལུང་བསྟན་པ་ཞུ་བའི་དུས་ཡིན་ནོ་སྙམ་ནས།
en: “Now is the time to request the Blessed One to explain about that anguished spirit.”

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: He approached the Blessed One, touched his head to the Blessed One’s feet, and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once he had taken a seat at one side, Venerable Mahā­maudgalyāyana inquired of the Blessed One,

source: བཙུན་པ་འདི་ན་བདག་གི་ལུགས་ཀྱིས་དུས་དུས་སུ་སེམས་ཅན་དམྱལ་བར་རྒྱུ་བར་བགྱིད་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་བགྱིད་དུད་འགྲོའི་ནང་དུ་རྒྱུ་བར་བགྱིད་མིའི་ནང་དུ་རྒྱུ་བར་བགྱིད་ལྷའི་ནང་དུ་རྒྱུ་བར་བགྱིད་དེ།
en: “Lord, it is my custom to wander from time to time among the hell beings, to wander among the anguished spirits, to wander among the animals, to wander among the humans, and to wander among the gods.

source: ལྷ་རྣམས་ཀྱི་འཆི་འཕོ་དང་ལྟུང་བ་དང་རྣམ་པར་འཐོར་བ་དང་རྣམ་པར་འཇིག་པའི་སྡུག་བསྔལ་གང་ལགས་པ་
en: and how the gods suffer through dying, falling, disintegrating, and decaying.

source: དེ་དག་མི་རྣམས་ལ་རྗོད་པར་བགྱིད་དེ་རྒྱུ་དེས་ན་དེ་དག་སྐྱོ་བར་འགྱུར་ལ།
en: Because of this, the people who hear me are filled with sorrow,

source: དེ་ལྟར་སྐྱོ་བར་གྱུར་ནས་ཀྱང་གོང་དུ་ཁྱད་པར་ཐོབ་པར་འགྱུར་ལགས་སོ། །
en: and from this sorrow they go on to achieve great things.

source: བཙུན་པ་བདག་ཡི་དགས་ཀྱི་ནང་དུ་རྒྱུ་བར་ཆས་ནས་མཉན་དུ་ཡོད་པ་ནས་མི་སྣང་བར་གྱུར་ཏེརི་བྱིན་ཏྱའི་ནགས་ཁུང་དུ་མཆིས་པ་ལས།
en: “Lord, as I was wandering among the anguished spirits, I disappeared from Śrāvastī, and in Vindhyācala, in a hollow in the forest,
